---
kind: property
id: P:Autodesk.Revit.DB.FamilyElementVisibility.IsShownInFine
source: html/d6bf2697-ac44-bef7-71cd-03e3f461ce8c.htm
---
# Autodesk.Revit.DB.FamilyElementVisibility.IsShownInFine Property

Indicates if the instance is display with Fine detail level in the view
of project document.

## Syntax (C#)
```csharp
public bool IsShownInFine { get; set; }
```

## Remarks
This property cannot be set to false if the other two detail levels are also false.